Repository: autohotkey-docs-translation/v2-ja
Catalog: omegat/project_save.tmx
Source language: en
Languages: ja

source: The Run function either splits this into a program name and parameters (everything else) or leaves that up to the system.
ja: Run機能は、これをプログラム名と パラメータ（それ以外のすべて）に分割するか、システムに委ねるかのどちらかです。

source: The RunAs function specifies a set of user credentials to use for all subsequent uses of Run and RunWait functions.
ja: RunAs関数は、RunおよびRunWait関数のその後のすべての使用で使用するユーザー資格情報のセットを指定します。

source: The SM_XVIRTUALSCREEN, SM_YVIRTUALSCREEN metrics are the coordinates of the top-left corner of the virtual screen.
ja: SM_XVIRTUALSCREEN、SM_YVIRTUALSCREENメトリックスは、仮想スクリーンの左上隅の座標です。

source: The SS_NOTIFY style causes the OS to automatically copy the control's text to the clipboard when it is double-clicked.
ja: SS_NOTIFYスタイルは、コントロールがダブルクリックされたときに、OSが自動的にコントロールのテキストをクリップボードにコピーするようにします。

source: The Send, SendText, SendInput, SendPlay and SendEvent functions send simulated keystrokes and mouse clicks to the active window.
ja: Send、SendText、SendInput、SendPlay、SendEvent関数は、アクティブウィンドウにキーストロークやマウスクリックのシミュレーションを送信します。

source: The SendLevel function controls which artificial keyboard and mouse events are ignored by hotkeys and hotstrings.
ja: SendLevel関数は、ホットキーやホットストリングがどの人工的なキーボードやマウスイベントを無視するかを制御します。

source: The SendMessage function sends a message to a window or control and waits for acknowledgement.
ja: SendMessage関数は、ウィンドウまたはコントロールにメッセージを送信し、確認応答を待ちます。

source: The SendMode function causes Send, Click, MouseMove, MouseClick and MouseClickDrag to use the Event or Play mode rather than the default (Input).
ja: SendMode関数は、Send、Click、MouseMove、MouseClick、MouseClickDragがデフォルト（Input）ではなく、EventまたはPlayモードを使用するようにします。

source: The SetCapsLockState, SetNumLockState and SetScrollLockState functions set the state of the corresponding key.
ja: SetCapsLockState、SetNumLockState、SetScrollLockState 関数は、対応するキーの状態を設定します。

source: The SetControlDelay function sets the delay that will occur after each control-modifying function.
ja: SetControlDelay関数は、制御を変更する各機能の後に発生する遅延を設定します。

source: The SetDefaultMouseSpeed function sets the mouse speed that will be used if unspecified in Click, MouseMove, MouseClick and MouseClickDrag.
ja: SetDefaultMouseSpeed関数は、Click関数、MouseMove関数、MouseClick関数、MouseClickDrag関数で指定がない場合に使用されるマウスポインターの速度を設定します。

source: The SetKeyDelay function sets the delay that will occur after each keystroke sent by the Send or ControlSend functions.
ja: SetKeyDelay関数は、Send関数またはControlSend関数によって送信される各キーストロークの後に発生する遅延を設定します。

source: The SetMouseDelay function sets the delay that will occur after each mouse movement or click.
ja: SetMouseDelay関数は、マウスの移動またはクリックの後に発生する遅延を設定します。

source: The SetRegView function sets the registry view used by RegRead, RegWrite, RegDelete, RegDeleteKey and Loop Reg, allowing them in a 32-bit script to access the 64-bit registry view and vice versa.
ja: SetRegView関数は、RegRead、RegWrite、RegDelete、RegDeleteKey、Loop Regで使用するレジストリビューを設定し、32ビットスクリプトで64ビットレジストリビューにアクセスできるようにし、逆もまた然りです。

source: The SetStoreCapsLockMode function determines whether to restore the state of the CapsLock key after a Send function.
ja: SetStoreCapsLockMode関数は、Send関数を使用した後にCapsLockキーの状態を復元するかどうかを決定する関数です。

source: The SetTimer function causes a function to be called automatically and repeatedly at a specified time interval.
ja: SetTimer関数は、指定された時間間隔で自動的に繰り返し関数を呼び出すものです。

source: The SetTitleMatchMode function sets the matching behavior of the WinTitle parameter in built-in functions such as WinWait.
ja: SetTitleMatchMode関数は、WinWaitなどの組み込み関数におけるWinTitleパラメータのマッチング動作を設定します。

source: The SetWinDelay function sets the delay that will occur after each windowing function, such as WinActivate.
ja: SetWinDelay関数は、WinActivateなどの各ウィンドウ関数の後に発生する遅延を設定します。

source: The SetWorkingDir function changes the script's current working directory.
ja: SetWorkingDir関数は、スクリプトの現在の作業ディレクトリを変更します。

source: The Shutdown function shuts down, restarts, or logs off the system.
ja: シャットダウン関数は、システムのシャットダウン、再起動、ログオフを行います。

source: The Size event passes 0, -1 or 1 (consistent with WinGetMinMax) instead of 0, 1 or 2.
ja: Sizeイベントは、0、1、2の代わりに、0、-1、1（WinGetMinMaxと一致）を渡します。

source: The Sleep function waits the specified amount of time before continuing.
ja: スリープ機能は、指定された時間だけ待ってから続行する。

source: The Sort function arranges a variable's contents in alphabetical, numerical, or random order (optionally removing duplicates).
ja: Sort関数は、変数の内容をアルファベット順、数値順、ランダム順に並べる（オプションで重複を削除）。

source: The SoundBeep function emits a tone from the PC speaker.
ja: SoundBeep関数は、パソコンのスピーカーから音を鳴らす機能です。

source: The SoundGet and SoundSet functions identify components by walking the device topology graph and counting Connectors with the given name (or all Connectors if no name is given).
ja: SoundGet関数とSoundSet関数は、デバイスのトポロジーグラフをウォーキングし、指定された名前を持つコネクター（名前がない場合は全てのコネクター）をカウントすることでコンポーネントを特定します。

source: The SoundGetInterface function retrieves a native COM interface of a sound device or component.
ja: SoundGetInterface 関数は、サウンドデバイスまたはコンポーネントのネイティブ COM インタフェースを取得します。

source: The SoundGetMute function retrieves a mute setting of a sound device.
ja: SoundGetMute関数は、サウンドデバイスのミュート設定を取得します。

source: The SoundGetName function retrieves the name of a sound device or component.
ja: SoundGetName 関数は、サウンドデバイスまたはコンポーネントの名前を取得します。

source: The SoundGetVolume function retrieves a volume setting of a sound device.
ja: SoundGetVolume 関数は、サウンドデバイスの音量設定を取得します。

source: The SoundPlay function plays a sound, video, or other supported file type.
ja: SoundPlay機能は、サウンド、ビデオ、その他サポートされているファイルタイプを再生します。

source: The SoundSetMute function changes a mute setting of a sound device.
ja: SoundSetMute関数は、サウンドデバイスのミュート設定を変更します。

source: The SoundSetVolume function changes a volume setting of a sound device.
ja: SoundSetVolume 関数は、サウンドデバイスの音量設定を変更します。

source: The SplitPath function separates a file name or URL into its name, directory, extension, and drive.
ja: SplitPath関数は、ファイル名やURLを名前、ディレクトリ、拡張子、ドライブに分離します。

source: The Start Menu (or the active window's menu bar) can be suppressed by sending any keystroke.
ja: スタートメニュー（またはアクティブウィンドウのメニューバー）は、任意のキーストロークを送信することで抑制することができます。

source: The StatusBarWait function waits until a window's status bar contains the specified string.
ja: StatusBarWait関数は、ウィンドウのステータスバーに指定された文字列が含まれるまで待機する。

source: The StatusbarGetText function retrieves the text from a standard status bar control.
ja: StatusbarGetText 関数は、標準のステータスバーコントロールからテキストを取得します。

source: The Stop method was called or Start has not yet been called for the first time.
ja: Stopメソッドが呼び出されたか、Startがまだ呼び出されていない状態で、初めて呼び出されます。

source: The StrCompare function compares two strings alphabetically.
ja: StrCompare関数は、2つの文字列をアルファベット順に比較する。

source: The StrGet function copies a string from a memory address or buffer, optionally converting it from a given code page.
ja: StrGet関数は、メモリアドレスまたはバッファから文字列をコピーし、オプションで指定されたコードページから変換する。

source: The StrLen function retrieves the count of how many characters are in a string.
ja: StrLen関数は、文字列の文字数を取得して返します。

source: The StrLower, StrUpper and StrTitle functions convert a string to lowercase, uppercase or title case.
ja: StrLower、StrUpper、StrTitle関数は、文字列を小文字、大文字、タイトルケースに変換します。

source: The StrPtr function returns the current memory address of a string.
ja: StrPtr関数は、文字列の現在のメモリー・アドレスを返す。

source: The StrPut function copies a string to a memory address or buffer, optionally converting it to a given code page.
ja: StrPut関数は、文字列をメモリ・アドレスまたはバッファにコピーし、オプションで指定されたコード・ページに変換する。

source: The StrReplace function replaces the specified substring with a new string.
ja: StrReplace 関数は、指定された部分文字列を新しい文字列に置き換える。

source: The StrSplit function separates a string into an array of substrings using the specified delimiters.
ja: StrSplit関数は、指定された区切り文字を使用して文字列を部分文字列の配列に分割する。

source: The String function converts a value to a string.
ja: String関数は、値を文字列に変換します。

source: The SubStr function retrieves one or more characters from the specified position in a string.
ja: SubStr 関数は、文字列の指定された位置から 1 つ以上の文字を取り出します。

source: The Suspend function disables or enables all or selected hotkeys and hotstrings.
ja: サスペンド機能は、すべてまたは選択したホットキーとホットストリングを無効または有効にします。

source: The Switch statement executes one case from a list of mutually exclusive candidates.
ja: Switch文は、相互に排他的な候補のリストから1つのケースを実行する。

source: The SysGet function retrieves dimensions of system objects, and other system properties.
ja: SysGet 関数は、システム・オブジェクトの寸法やその他のシステム・プロパティを取得する。

source: The SysGetIPAddresses function returns an array of the system's IPv4 addresses.
ja: SysGetIPAddresses関数は、システムのIPv4アドレスの配列を返す。

source: The Text mode can be either enabled with {Text}, SendText or ControlSendText, which is similar to the Raw mode, except that no attempt is made to translate characters (other than `r, `n, `t and `b) to keycodes; instead, the fallback method is used for all of the remaining characters.
ja: テキストモードは{Text}、SendText、ControlSendTextのいずれかで有効にすることができ、Rawモードと似ていますが、文字（`r、`n、`t、`b以外）をキーコードに変換しようとしないことを除いて、残りのすべての文字に対してフォールバックメソッドが使用されます。

source: The Thread function sets the priority or interruptibility of threads.
ja: Thread関数は、スレッドの優先度や割り込み可能性を設定する。

source: The Throw statement signals the occurrence of an error.
ja: Throw文はエラーの発生を知らせる。

source: The ToolTip function creates an always-on-top window anywhere on the screen.
ja: ToolTip関数は、画面上の任意の場所に、常に上に表示されるウィンドウを作成します。

source: The ToolTip function is executed again with a blank Text parameter.
ja: ToolTip関数は、空白のTextパラメータで再度実行されます。

source: The TraySetIcon function changes the script's tray icon (which is also used by GUI and dialog windows).
ja: TraySetIcon関数は、スクリプトのトレイアイコン（GUIやダイアログウィンドウでも使用される）を変更します。

source: The TrayTip function creates a balloon message window near the tray icon.
ja: TrayTip関数は、トレイアイコンの近くにバルーンメッセージウィンドウを作成します。

source: The TreeView control displays a hierarchy of items by indenting child items beneath their parents.
ja: TreeViewコントロールは、親アイテムの下に子アイテムをインデントすることで、アイテムの階層を表示します。

source: The Trim, LTrim and RTrim functions trim characters from the beginning and/or end of a string.
ja: Trim、LTrim、RTrim関数は、文字列の先頭または末尾から文字を切り取ります。

source: The Try statement guards one or more statements against runtime errors and values thrown by the Throw statement.
ja: Tryステートメントは、実行時エラーやThrowステートメントでスローされた値からステートメントを保護します。

source: The Type function returns the class name of a value.
ja: Type関数は、値のクラス名を返します。

source: The Until statement applies a condition to the continuation of a Loop or For-loop.
ja: Until文は、LoopまたはForループの継続に条件を適用します。

source: The VARTYPE is restricted to a subset of the variant types.
ja: VARTYPEは、バリアントタイプのサブセットに限定されます。

source: The VarRef class currently has no predefined methods or properties, but value is VarRef can be used to test if a value is a VarRef.
ja: VarRefクラスには現在、定義済みのメソッドやプロパティはありませんが、value is VarRefを使用して、値がVarRefであるかどうかをテストすることが可能です。

source: The VarRef would typically be passed to a function, but could be stored in an array or property.
ja: VarRefは通常関数に渡されるが、配列やプロパティに格納することもできる。

source: The VarSetStrCapacity function enlarges a variable's holding capacity or frees its memory.
ja: VarSetStrCapacity関数は、変数の保持容量を増やしたり、メモリを解放したりします。

source: The VerCompare function compares two version strings.
ja: VerCompare関数は、2つのバージョン文字列を比較する。

source: The While loop statement performs one or more statements repeatedly until the specified expression evaluates to false.
ja: Whileループ文は、指定した式がfalseと評価されるまで、1つ以上の文を繰り返し実行します。

source: The WinActivate function activates the specified window.
ja: WinActivate関数は、指定されたウィンドウをアクティブにします。

source: The WinActivateBottom function is similar to the WinActivate function but it activates the bottommost matching window rather than the topmost.
ja: WinActivateBottom関数はWinActivate関数に似ているが、一番上ではなく一番下のマッチするウィンドウをアクティブにする。

source: The WinActive function checks if the specified window is active and returns its unique ID (HWND).
ja: WinActive関数は、指定されたウィンドウがアクティブかどうかをチェックしてそのユニークID（HWND）を返します。

source: The WinClose function closes the specified window.
ja: WinClose関数は、指定したウィンドウを閉じます。

source: The WinExist function checks if the specified window exists and returns the unique ID (HWND) of the first matching window.
ja: WinExist関数は、指定されたウィンドウが存在するかどうかをチェックし、最初にマッチしたウィンドウのユニークID（HWND）を返す。

source: The WinGetClass function retrieves the specified window's class name.
ja: WinGetClass関数は、指定されたウィンドウのクラス名を取得します。

source: The WinGetClientPos function retrieves the position and size of the specified window's client area.
ja: WinGetClientPos関数は、指定されたウィンドウのクライアント領域の位置とサイズを取得します。

source: The WinGetControls function returns an array of names (ClassNNs) for all controls in the specified window.
ja: WinGetControls関数は、 指定されたウィンドウ内のすべてのコントロールの名前（ClassNN）の配列を返します。

source: The WinGetControls function returns the control names for all controls in the specified window.
ja: WinGetControls関数は、指定されたウィンドウ内のすべてのコントロールのコントロール名を返します。

source: The WinGetControlsHwnd function returns an array of unique ID numbers (HWNDs) for all controls in the specified window.
ja: WinGetControlsHwnd関数は、指定したウィンドウ内のすべてのコントロールのID（HWND）の配列を返します。

source: The WinGetControlsHwnd function returns the unique ID numbers for all controls in the specified window.
ja: WinGetControlsHwnd関数は、指定したウィンドウ内のすべてのコントロールの一意なID番号を返す。

source: The WinGetCount function returns the number of existing windows that match the specified criteria.
ja: WinGetCount関数は、指定した条件に合致する既存のウィンドウの数を返します。

source: The WinGetID function returns the unique ID number (HWND) of the specified window.
ja: WinGetID関数は、指定されたウィンドウのID（HWND）を返します。

source: The WinGetID function returns the unique ID number of the specified window.
ja: WinGetID関数は、指定されたウィンドウの固有のID番号を返す。

source: The WinGetIDLast function returns the unique ID number (HWND) of the last/bottommost window if there is more than one match.
ja: WinGetIDLast関数は、一致するウィンドウが複数ある場合に、最後または一番下のウィンドウのウィンドウハンドル（HWND）を返します。

source: The WinGetIDLast function returns the unique ID number of the last/bottommost window if there is more than one match.
ja: WinGetIDLast関数は、一致するウィンドウが複数ある場合、最後/一番下のウィンドウの一意のID番号を返す。

source: The WinGetList function returns an array of unique ID numbers (HWNDs) for all existing windows that match the specified criteria.
ja: WinGetList関数は、指定された条件に合致する全てのウィンドウのID番号（HWND）の配列を返します。

source: The WinGetList function returns the unique ID numbers of all existing windows that match the specified criteria.
ja: WinGetList関数は、指定された条件に一致するすべての既存のウィンドウの一意のID番号を返します。

source: The WinGetMinMax function returns a non-zero number if the specified window is maximized or minimized.
ja: WinGetMinMax関数は、指定されたウィンドウが最大化または最小化されているときに、それぞれ1と-1を返します。

source: The WinGetMinMax function returns the state whether the specified window is maximized or minimized.
ja: WinGetMinMax関数は、指定されたウィンドウが最大化されているか最小化されているかの状態を返します。

source: The WinGetPID function returns the Process ID number (PID) of the specified window.
ja: WinGetPID関数は、指定されたウィンドウのプロセスID番号を返します。

source: The WinGetPID function returns the Process ID number of the specified window.
ja: WinGetPID関数は、指定されたウィンドウのプロセスID番号を返す。

source: The WinGetPos function retrieves the position and size of the specified window.
ja: WinGetPos関数は、指定されたウィンドウの位置とサイズを取得します。

source: The WinGetProcessName function returns the name of the process that owns the specified window.
ja: WinGetProcessName関数は、指定されたウィンドウを所有するプロセスの名前を返します。

source: The WinGetProcessPath function returns the full path and name of the process that owns the specified window.
ja: WinGetProcessPath関数は、指定されたウィンドウを所有するプロセスのフルパスと名前を返します。

source: The WinGetStyle and WinGetExStyle functions return the style or extended style (respectively) of the specified window.
ja: WinGetStyle関数とWinGetExStyle関数は、それぞれ指定されたウィンドウのスタイルまたは拡張スタイルを返します。

source: The WinGetText function retrieves the text from the specified window.
ja: WinGetText関数は、指定されたウィンドウからテキストを取得します。

source: The WinGetTitle function retrieves the title of the specified window.
ja: WinGetTitle関数は、指定されたウィンドウのタイトルを取得します。

source: The WinGetTransColor function returns the color that is marked transparent in the specified window.
ja: WinGetTransColor関数は、指定したウィンドウの中で透明と表示されている色を返します。

source: The WinGetTransparent function returns the degree of transparency of the specified window.
ja: WinGetTransparent関数は、指定したウィンドウの透明度を返します。

source: The WinHide function hides the specified window.
ja: WinHide関数は、指定したウィンドウを非表示にします。

source: The WinKill function forces the specified window to close.
ja: WinKill関数は、指定したウィンドウを強制的に閉じます。

source: The WinMaximize function enlarges the specified window to its maximum size.
ja: WinMaximize関数は、指定されたウィンドウを最大サイズに拡大する。

source: The WinMinimize function collapses the specified window into a button on the task bar.
ja: WinMinimize関数は、指定したウィンドウをタスクバーに最小化します。

source: The WinMinimizeAll and WinMinimizeAllUndo functions minimize or unminimize all windows.
ja: WinMinimizeAllおよびWinMinimizeAllUndo関数は、全てのウィンドウを最小化または最小化を解除します。

source: The WinMove function changes the position and/or size of the specified window.
ja: WinMove関数は、指定したウィンドウの位置やサイズを変更します。

source: The WinMoveBottom function sends the specified window to the bottom of stack; that is, beneath all other windows.
ja: WinMoveBottom関数は、指定されたウィンドウをスタックの一番下、つまり他のすべてのウィンドウの下に送ります。

source: The WinMoveTop function brings the specified window to the top of the stack without explicitly activating it.
ja: WinMoveTop関数は、明示的にウィンドウをアクティブにすることなく、指定したウィンドウをスタックの一番上に持ってきます。

source: The WinRedraw function redraws the specified window.
ja: WinRedraw関数は、指定されたウィンドウを再描画します。

source: The WinRestore function unminimizes or unmaximizes the specified window if it is minimized or maximized.
ja: WinRestore関数は、指定されたウィンドウが最小化または最大化されている場合、最小化または最大化を解除します。

source: The WinSetAlwaysOnTop function makes the specified window stay on top of all other windows (except other always-on-top windows).
ja: WinSetAlwaysOnTop関数は、指定されたウィンドウを、他のすべてのウィンドウ（他の常に上にあるウィンドウを除く）の上に表示する。

source: The WinSetEnabled function enables or disables the specified window.
ja: WinSetEnabled関数は、指定されたウィンドウを有効または無効にします。

source: The WinSetRegion function changes the shape of the specified window to be the specified rectangle, ellipse, or polygon.
ja: WinSetRegion関数は、指定されたウィンドウの形状を、指定された矩形、楕円、多角形に変更する。

source: The WinSetStyle and WinSetExStyle functions change the style or extended style of the specified window, respectively.
ja: WinSetStyle関数とWinSetExStyle関数は、それぞれ指定されたウィンドウのスタイルまたは拡張スタイルを変更します。

source: The WinSetTitle function changes the title of the specified window.
ja: WinSetTitle関数は、指定したウィンドウのタイトルを変更する。

source: The WinSetTransColor function makes all pixels of the chosen color invisible inside the specified window.
ja: WinSetTransColor関数は、選択した色のすべてのピクセルを、指定したウィンドウ内で非表示にします。

source: The WinSetTransparent function makes the specified window semi-transparent.
ja: WinSetTransparent関数は、指定されたウィンドウを半透明にする。

source: The WinShow function unhides the specified window.
ja: WinShow関数は、指定されたウィンドウの非表示を解除します。

source: The WinWait function waits until the specified window exists.
ja: WinWait関数は、指定されたウィンドウが存在するまで待つ。

source: The WinWaitActive and WinWaitNotActive functions wait until the specified window is active or not active.
ja: WinWaitActive関数とWinWaitNotActive関数は、指定されたウィンドウがアクティブまたは非アクティブになるまで待つ。

source: The WinWaitClose function waits until no matching windows can be found.
ja: WinWaitClose関数は、一致するウィンドウが見つからなくなるまで待ちます。

source: The Windows directory.
ja: Windowsのディレクトリ。

source: The X (horizontal), Y (vertical), and Z (altitude/depth) axes of the joystick.
ja: ジョイスティックのX軸（水平）、Y軸（垂直）、Z軸（高度/深度）です。

source: The X and Y coordinates (in pixels) of the upper left corner of Control's new location.
ja: コントロールの新しい位置の左上隅のX、Y座標（ピクセル単位）。

source: The X and Y coordinates (in pixels) of the upper left corner of the target window's new location.
ja: ターゲットウィンドウの新しい位置の左上隅のX座標とY座標（ピクセル単位）。

source: The X and Y coordinates of the dialog.
ja: ダイアログのX座標とY座標

source: The X and Y coordinates of the ending corner of the rectangle to search.
ja: 検索する矩形の終了角のX、Y座標。

source: The X and Y coordinates of the lower right corner of the rectangle to search.
ja: 検索する矩形の右下隅のX、Y座標。

source: The X and Y coordinates of the pixel.
ja: 画素の X 座標と Y 座標を指定します。

source: The X and Y coordinates of the starting corner of the rectangle to search.
ja: 検索する矩形の開始角のX、Y座標。

source: The X and Y coordinates of the upper left corner of the rectangle to search.
ja: 検索する矩形の左上隅のX、Y座標。

source: The X and Y coordinates of where the files were dropped, relative to the upper-left corner of the window's client area.
ja: ファイルがドロップされた場所のX、Y座標（ウィンドウのクライアント領域の左上隅からの相対座標）。

source: The X and Y coordinates of where the script should display the menu (e.g. MyContextMenu.Show X, Y).
ja: スクリプトがメニューを表示する位置のX、Y座標（例：MyContextMenu.Show X, Y）です。

source: The X and Y coordinates to move the mouse to.
ja: XとYの座標にマウスを移動させます。

source: The X coordinate must precede the Y coordinate and there must be at least one space or tab between them.
ja: X座標はY座標の前にあり、その間に少なくとも1つのスペースまたはタブが必要です。

source: The Y coordinate is " y ".
ja: Y座標は" y ".

source: The __Enum method is called when the object is passed to a for-loop.
ja: Enumメソッドは、オブジェクトがforループに渡されるときに呼び出される。

source: The __Item property is invoked when the indexing operator (array syntax) is used with the object.
ja: Itemプロパティは、インデックス演算子（配列構文）がオブジェクトと共に使用されるときに呼び出される。

source: The `a option implicitly enables (*BSR_UNICODE).
ja: `a オプションは暗黙のうちに(*BSR_UNICODE)を有効にします。

source: The `a, `n and `r options affect the behavior of anchors (^ and $) and the dot/period pattern.
ja: a、`n、`r オプションはアンカー（^ と $）とドット/ピリオドパターンの動作に影響する。

source: The ability to run the script with a keyboard shortcut (such as F5).
ja: キーボードショートカット（F5など）でスクリプトを実行できること。

source: The above code is perfectly acceptable.
ja: 上記のコードはまったく問題ない。

source: The above example can be revised to use any of these keys:
ja: 上記の例は、これらのキーのいずれかを使用するように修正することができる：

source: The above example does not alter B itself.
ja: 上記の例では、B自体は変更されていない。

source: The above is known as a function definition because it creates a function named "Add" (not case sensitive) and establishes that anyone who calls it must provide exactly two parameters (x and y).
ja: 上記は、"Add"という名前の関数（大文字小文字を区別しない）を作成し、それを呼び出す人は正確に2つのパラメータ（xとy）を提供しなければならないと定めていることから、関数定義として知られています。

source: The above is known as a function definition because it creates a function named "Add" (not case-sensitive) and establishes that anyone who calls it must provide exactly two parameters (x and y).
ja: 上記は、「Add」という名前の関数（大文字小文字を区別しない）を作成し、それを呼び出す人は正確に2つのパラメータ（xとy）を提供しなければならないと定めていることから、関数定義として知られています。

source: The absolute value of Period must be no larger than 4294967295 ms (49.7 days).
ja: Periodの絶対値は、4294967295ms（49.7日）以下でなければならない。

source: The absolute value of this parameter is used as the approximate number of milliseconds that must pass before the timer is executed.
ja: このパラメータの絶対値は、タイマーが実行されるまでに経過しなければならないミリ秒の概算値として使用されます。

source: The acronyms used with the size-type cursors are compass directions, e.g. NESW = NorthEast+SouthWest.
ja: サイズタイプのカーソルで使われる頭字語はコンパスの方向である。例えば、NESW = NorthEast+SouthWestである。

source: The act of running the Program is not restricted, and the output from the Program is covered only if its contents constitute a work based on the Program (independent of having been made by running the Program).
ja: プログラム』を実行する行為は制限されず、『プログラム』からの出力は、その内容が『プログラム』に基づく著作物(『プログラム』を実行することによって作成されたこととは無関係に)を構成する場合にのみ対象となります。

source: The actual delay time might wind up being longer than what was requested if the CPU is under load.
ja: CPUに負荷がかかっている場合、実際の遅延時間は要求されたものよりも長くなるかもしれない。

source: The address can be stored in a structure or another variable, and passed indirectly to DllCall or SendMessage or used in other ways, for as long as it remains valid as described above.
ja: このアドレスは、構造体や他の変数に格納し、DllCallや SendMessageに間接的に渡したり、他の方法で使用したりすることができる。

source: The address can be stored in a structure or another variable, and passed indirectly to DllCall or SendMessage or used in other ways.
ja: このアドレスは、構造体や他の変数に格納し、DllCallや SendMessageに間接的に渡したり、他の方法で使用することができる。
